a=[8,3,2]
# a.append('545') добавляет в список
# print(a)
# a.remove(21) #удаляет элеменет из списка
# a.sort() сортирует буквы и цифры буквы по алфавиту а цифры с меньшего до большего
# print(a)
b={'key':'hehe',12:23,45:32 ,'hi':5} 
# e=b.keys() выводит только ключи
# e=b.values() выводит только значения
# y=b.get('key') гет выводит значение ключа

print(y)
# c=('hihi',124,'haha','hello',) кортеж или тапл
# d={'ugu',123,'uu'} множество или сет

# list() # Изменяйемый , Лист
# a = [3,4,7,4,3,6,8,9,4.6,-5]
# tuple() # Неизменяемый, Кортеж
# b = (1, 1, 1, 3, 3,31,1)
# dict() # Словарь Изменяемый , Ключ:значение (Key:Value)
# c = {'apple':2,'malon': 1,'Jhon': 'Constantin','key':[1,3,4,5,6,7,8,84]}
# set() # Изменяемые ,Множества, Каждый элемет уникален 
# d = {'Apple','Malon','oragne'}
