 # a = 3 Тип данных чисел (integer (int))
# b = 'Hello world' Тип данных строки (string(str))
# c = 3.5 Тип данных с плавающей запятой (float(float))
# d = True Тип данных истины (booling (bool))

# a = [2,'hello',8.8,True] Тип данных list() Тип данных лист 
# b = {key:value} Тип Данных словарь
# c = ()  Тип данныз кортеж
# d = {}    Тип данных множетсва

# print('Hello')


# num = int(input ('Enter num :'))
# num2 =int(input('Enter num :'))
# c=num+num2
# print(c)
# str=числа в строки
# инт=СТРОКИ В ЧИСЛА




# методы
n ='Hello'
print(n.lower())
print(n.upper())
print(len(n))
# лен пишет сколько в слове букв
#  делает буквы больщими ловер
# делает буквы малеенькими уппер


n = 5
m=6
#  print(max(n,m)) дает самое большое число
# print(min(n,m) )дает самое маленькое число


# c=n**2 квадрат числа
# c = n//m еление без остатка
# b = n % m остаток уменьшает в меньшую сторону если даст 1,8 даст 1,5











